venu-madhav-anyam/STM32/20_SPI_Driver/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
#include "stm32l476xx.h"
#include "stm32l476xx_spi.h"
#include "stm32l476xx_gpio.h"
#include "w25qxx.h"
#include <string.h>

SPI_Handle_t SPI1Handle;
//#define CS_LOW()  GPIO_WriteToOutputPin(GPIOA, 4, 0)
//#define CS_HIGH() GPIO_WriteToOutputPin(GPIOA, 4, 1)

void SPI_GPIO_Init(void) {
	GPIO_Handle_t spiPins;

	spiPins.pGPIOx = GPIOA;

	spiPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	spiPins.GPIO_PinConfig.GPIO_PinAltFunMode = 5; // AF5 (SPI1)
	spiPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	spiPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	spiPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	// SCK
	spiPins.GPIO_PinConfig.GPIO_PinNumber = 5;
	GPIO_Init(&spiPins);

	// MISO
	spiPins.GPIO_PinConfig.GPIO_PinNumber = 6;
	GPIO_Init(&spiPins);

	// MOSI
	spiPins.GPIO_PinConfig.GPIO_PinNumber = 7;
	GPIO_Init(&spiPins);

	// CS (manual)
	spiPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUTPUT;
	spiPins.GPIO_PinConfig.GPIO_PinNumber = 4;
	GPIO_Init(&spiPins);

	GPIO_WriteToOutputPin(GPIOA, 4, 1); // CS HIGH
}

uint8_t tx_data = 'A';
uint8_t rx_data = 0;

int main(void)
{
    SPI_GPIO_Init();

    SPI1Handle.pSPIx = SPI1;

    SPI1Handle.SPI_Config.DeviceMode = SPI_DEVICE_MODE_MASTER;
    SPI1Handle.SPI_Config.BusConfig = SPI_BUS_CONFIG_FD;
    SPI1Handle.SPI_Config.SclkSpeed = SPI_SCLK_SPEED_DIV16;
    SPI1Handle.SPI_Config.DFF = SPI_DFF_8BITS;
    SPI1Handle.SPI_Config.CPOL = SPI_CPOL_LOW;
    SPI1Handle.SPI_Config.CPHA = SPI_CPHA_LOW;
    SPI1Handle.SPI_Config.SSM = SPI_SSM_EN;

    SPI_Init(&SPI1Handle);

    while (1)
    {
        rx_data = SPI_Transfer(SPI1, tx_data);

        if (tx_data == rx_data)
        {
            // SUCCESS
        }
        else
        {
            // FAIL
        }
    }
}



/*

 int main(void) {
	SPI_GPIO_Init(); // you already wrote

	SPI1Handle.pSPIx = SPI1;

	SPI1Handle.SPI_Config.DeviceMode = SPI_DEVICE_MODE_MASTER;
	SPI1Handle.SPI_Config.BusConfig = SPI_BUS_CONFIG_FD;
	SPI1Handle.SPI_Config.SclkSpeed = SPI_SCLK_SPEED_DIV16;
	SPI1Handle.SPI_Config.DFF = SPI_DFF_8BITS;
	SPI1Handle.SPI_Config.CPOL = SPI_CPOL_LOW;
	SPI1Handle.SPI_Config.CPHA = SPI_CPHA_LOW;
	SPI1Handle.SPI_Config.SSM = SPI_SSM_EN;

	SPI_Init(&SPI1Handle);
	W25Q_Init();

	uint8_t id[3];

	W25Q_ReadID(id);

	//printf("Flash ID: %02X %02X %02X\r\n", id[0], id[1], id[2]);

	uint8_t data[] = "HELLO";
	uint8_t read[10];

	W25Q_EraseSector(0x000000);
	W25Q_Write(0x000000, data, sizeof(data));

	W25Q_Read(0x000000, read, sizeof(data));

	//printf("Read: %s\r\n", read);

	while (1)
		;
}

 */
